CSCI112/org/[03]assign-1.org

Student Name: Yahia Hany Gaber
Student ID: 231000412

* Assignment #1

** Question 1: Hello World!

A program to print "Hello World!".

#+begin_src c

#include <stdio.h>

int main() {

  printf("Hello World!\n");

  return 0;
}

#+end_src

** Question 2: Extremely basic

A program to read two variables =A= and =B= and assign the value of their sum to =X=.

#+begin_src c

#include <stdio.h>

int main() {

  int A, B;

  scanf("%d", &A); scanf("%d", &B);

  int X = A + B;

  printf("X = %d\n", X);

  return 0;
}

#+end_src

** Question 3: Area of a circle

A program to calculate the area of a circle using the radius =R= which is taken as input.

#+begin_src c

#include <stdio.h>

int main() {

  float R;

  scanf("%f", &R);

  printf("A = %f\n", (3.14159 * R * R));

  return 0;
}

#+end_src

** Question 4: Simple Sum

A program that reads two integers =A= and =B= and assigns their sum to the variable =SOMA= and prints it.

#+begin_src c

#include <stdio.h>

int main() {

  int A, B;

  scanf("%d", &A); scanf("%d", &B);

  int SOMA = A + B;

  printf("SOMA = %d\n", SOMA);

  return 0;
}

#+end_src

** Question 5: Simple Product

A program that reads two integers =A= and =B= and assigns their product to the variable =PROD= and prints it.

#+begin_src c

#include <stdio.h>

int main() {

  int A, B;

  scanf("%d", &A); scanf("%d", &B);

  int PROD = A * B;

  printf("PROD = %d\n", PROD);

  return 0;
}

#+end_src
