CSCI112/HTML/[03]assign-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-23 Fri 20:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Yahia Gaber" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org88291eb">1. Assignment #1</a>
<ul>
<li><a href="#org8a0bfce">1.1. Question 1: Hello World!</a></li>
<li><a href="#orgcfd81ac">1.2. Question 2: Extremely basic</a></li>
<li><a href="#org489b8ca">1.3. Question 3: Area of a circle</a></li>
<li><a href="#orgd1e5948">1.4. Question 4: Simple Sum</a></li>
<li><a href="#orgd953b6b">1.5. Question 5: Simple Product</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Student Name: Yahia Hany Gaber
Student ID: 231000412
</p>
<div id="outline-container-org88291eb" class="outline-2">
<h2 id="org88291eb"><span class="section-number-2">1.</span> Assignment #1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8a0bfce" class="outline-3">
<h3 id="org8a0bfce"><span class="section-number-3">1.1.</span> Question 1: Hello World!</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A program to print &ldquo;Hello World!&rdquo;.
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #87ceeb; font-weight: bold;">#include</span> <span style="color: #fab795;">&lt;stdio.h&gt;</span>

<span style="color: #87ceeb;">int</span> <span style="color: #87ceeb;">main</span>() {

  printf(<span style="color: #fab795;">"Hello World!\n"</span>);

  <span style="color: #b877db;">return</span> <span style="color: #f09383; font-weight: bold;">0</span>;
}

</pre>
</div>
</div>
</div>
<div id="outline-container-orgcfd81ac" class="outline-3">
<h3 id="orgcfd81ac"><span class="section-number-3">1.2.</span> Question 2: Extremely basic</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A program to read two variables <code>A</code> and <code>B</code> and assign the value of their sum to <code>X</code>.
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #87ceeb; font-weight: bold;">#include</span> <span style="color: #fab795;">&lt;stdio.h&gt;</span>

<span style="color: #87ceeb;">int</span> <span style="color: #87ceeb;">main</span>() {

  <span style="color: #87ceeb;">int</span> <span style="color: #e95678;">A</span>, <span style="color: #e95678;">B</span>;

  scanf(<span style="color: #fab795;">"%d"</span>, &amp;A); scanf(<span style="color: #fab795;">"%d"</span>, &amp;B);

  <span style="color: #87ceeb;">int</span> <span style="color: #e95678;">X</span> = A + B;

  printf(<span style="color: #fab795;">"X = %d\n"</span>, X);

  <span style="color: #b877db;">return</span> <span style="color: #f09383; font-weight: bold;">0</span>;
}

</pre>
</div>
</div>
</div>
<div id="outline-container-org489b8ca" class="outline-3">
<h3 id="org489b8ca"><span class="section-number-3">1.3.</span> Question 3: Area of a circle</h3>
<div class="outline-text-3" id="text-1-3">
<p>
A program to calculate the area of a circle using the radius <code>R</code> which is taken as input.
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #87ceeb; font-weight: bold;">#include</span> <span style="color: #fab795;">&lt;stdio.h&gt;</span>

<span style="color: #87ceeb;">int</span> <span style="color: #87ceeb;">main</span>() {

  <span style="color: #87ceeb;">float</span> <span style="color: #e95678;">R</span>;

  scanf(<span style="color: #fab795;">"%f"</span>, &amp;R);

  printf(<span style="color: #fab795;">"A = %f\n"</span>, (<span style="color: #f09383; font-weight: bold;">3.14159</span> * R * R));

  <span style="color: #b877db;">return</span> <span style="color: #f09383; font-weight: bold;">0</span>;
}

</pre>
</div>
</div>
</div>
<div id="outline-container-orgd1e5948" class="outline-3">
<h3 id="orgd1e5948"><span class="section-number-3">1.4.</span> Question 4: Simple Sum</h3>
<div class="outline-text-3" id="text-1-4">
<p>
A program that reads two integers <code>A</code> and <code>B</code> and assigns their sum to the variable <code>SOMA</code> and prints it.
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #87ceeb; font-weight: bold;">#include</span> <span style="color: #fab795;">&lt;stdio.h&gt;</span>

<span style="color: #87ceeb;">int</span> <span style="color: #87ceeb;">main</span>() {

  <span style="color: #87ceeb;">int</span> <span style="color: #e95678;">A</span>, <span style="color: #e95678;">B</span>;

  scanf(<span style="color: #fab795;">"%d"</span>, &amp;A); scanf(<span style="color: #fab795;">"%d"</span>, &amp;B);

  <span style="color: #87ceeb;">int</span> <span style="color: #e95678;">SOMA</span> = A + B;

  printf(<span style="color: #fab795;">"SOMA = %d\n"</span>, SOMA);

  <span style="color: #b877db;">return</span> <span style="color: #f09383; font-weight: bold;">0</span>;
}

</pre>
</div>
</div>
</div>
<div id="outline-container-orgd953b6b" class="outline-3">
<h3 id="orgd953b6b"><span class="section-number-3">1.5.</span> Question 5: Simple Product</h3>
<div class="outline-text-3" id="text-1-5">
<p>
A program that reads two integers <code>A</code> and <code>B</code> and assigns their product to the variable <code>PROD</code> and prints it.
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #87ceeb; font-weight: bold;">#include</span> <span style="color: #fab795;">&lt;stdio.h&gt;</span>

<span style="color: #87ceeb;">int</span> <span style="color: #87ceeb;">main</span>() {

  <span style="color: #87ceeb;">int</span> <span style="color: #e95678;">A</span>, <span style="color: #e95678;">B</span>;

  scanf(<span style="color: #fab795;">"%d"</span>, &amp;A); scanf(<span style="color: #fab795;">"%d"</span>, &amp;B);

  <span style="color: #87ceeb;">int</span> <span style="color: #e95678;">PROD</span> = A * B;

  printf(<span style="color: #fab795;">"PROD = %d\n"</span>, PROD);

  <span style="color: #b877db;">return</span> <span style="color: #f09383; font-weight: bold;">0</span>;
}

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yahia Gaber</p>
<p class="date">Created: 2024-02-23 Fri 20:40</p>
</div>
</body>
</html>
